Repository: leorm037/megafacil
Catalog: translations/security.*.xlf
Languages: pt_br

source: An authentication exception occurred.
pt_br: Uma exceção ocorreu durante a autenticação.

source: Authentication credentials could not be found.
pt_br: As credenciais de autenticação não foram encontradas.

source: Authentication request could not be processed due to a system problem.
pt_br: A solicitação de autenticação não pôde ser processada devido a um problema no sistema.

source: Invalid credentials.
pt_br: Credenciais inválidas.

source: Cookie has already been used by someone else.
pt_br: Este cookie já foi usado por outra pessoa.

source: Not privileged to request the resource.
pt_br: Sem privilégio para solicitar o recurso.

source: Invalid CSRF token.
pt_br: Token CSRF inválido.

source: No authentication provider found to support the authentication token.
pt_br: Nenhum provedor de autenticação encontrado para suportar o token de autenticação.

source: No session available, it either timed out or cookies are not enabled.
pt_br: Nenhuma sessão disponível, ela expirou ou os cookies não estão habilitados.

source: No token could be found.
pt_br: Nenhum token foi encontrado.

source: Username could not be found.
pt_br: Nome de usuário não encontrado.

source: Account has expired.
pt_br: A conta está expirada.

source: Credentials have expired.
pt_br: As credenciais estão expiradas.

source: Account is disabled.
pt_br: Conta desativada.

source: Account is locked.
pt_br: A conta está travada.

source: Too many failed login attempts, please try again later.
pt_br: Muitas tentativas de login malsucedidas, por favor, tente novamente mais tarde.

source: Invalid or expired login link.
pt_br: Link de login inválido ou expirado.

source: Too many failed login attempts, please try again in %minutes% minute.
pt_br: Muitas tentativas de login inválidas, por favor, tente novamente em um minuto.

source: Too many failed login attempts, please try again in %minutes% minutes.
pt_br: Muitas tentativas de login sem sucesso, por favor, tente novamente em %minutes% minutos.
