Repository: leorm037/megafacil
Catalog: translations/validators.*.xlf
Languages: pt_br

source: This value should be false.
pt_br: Este valor deve ser falso.

source: This value should be true.
pt_br: Este valor deve ser verdadeiro.

source: This value should be of type {{ type }}.
pt_br: Este valor deve ser do tipo {{ type }}.

source: This value should be blank.
pt_br: Este valor deve ser vazio.

source: The value you selected is not a valid choice.
pt_br: O valor selecionado não é uma opção válida.

source: You must select at least {{ limit }} choice.|You must select at least {{ limit }} choices.
pt_br: Você deve selecionar, no mínimo, {{ limit }} opção.|Você deve selecionar, no mínimo, {{ limit }} opções.

source: You must select at most {{ limit }} choice.|You must select at most {{ limit }} choices.
pt_br: Você deve selecionar, no máximo, {{ limit }} opção.|Você deve selecionar, no máximo, {{ limit }} opções.

source: One or more of the given values is invalid.
pt_br: Um ou mais valores informados são inválidos.

source: This field was not expected.
pt_br: Este campo não era esperado.

source: This field is missing.
pt_br: Este campo está ausente.

source: This value is not a valid date.
pt_br: Este valor não é uma data válida.

source: This value is not a valid datetime.
pt_br: Este valor não é uma data e hora válida.

source: This value is not a valid email address.
pt_br: Este valor não é um endereço de e-mail válido.

source: The file could not be found.
pt_br: O arquivo não foi encontrado.

source: The file is not readable.
pt_br: O arquivo não pode ser lido.

source: The file is too large ({{ size }} {{ suffix }}). Allowed maximum size is {{ limit }} {{ suffix }}.
pt_br: O arquivo é muito grande ({{ size }} {{ suffix }}). O tamanho máximo permitido é {{ limit }} {{ suffix }}.

source: The mime type of the file is invalid ({{ type }}). Allowed mime types are {{ types }}.
pt_br: O tipo mime do arquivo é inválido ({{ type }}). Os tipos mime permitidos são {{ types }}.

source: This value should be {{ limit }} or less.
pt_br: Este valor deve ser {{ limit }} ou menos.

source: This value is too long. It should have {{ limit }} character or less.|This value is too long. It should have {{ limit }} characters or less.
pt_br: Este valor é muito longo. Deve ter {{ limit }} caractere ou menos.|Este valor é muito longo. Deve ter {{ limit }} caracteres ou menos.

source: This value should be {{ limit }} or more.
pt_br: Este valor deve ser {{ limit }} ou mais.

source: This value is too short. It should have {{ limit }} character or more.|This value is too short. It should have {{ limit }} characters or more.
pt_br: Este valor é muito curto. Deve ter {{ limit }} caractere ou mais.|Este valor é muito curto. Deve ter {{ limit }} caracteres ou mais.

source: This value should not be blank.
pt_br: Este valor não deve ser vazio.

source: This value should not be null.
pt_br: Este valor não deve ser nulo.

source: This value should be null.
pt_br: Este valor deve ser nulo.

source: This value is not valid.
pt_br: Este valor não é válido.

source: This value is not a valid time.
pt_br: Este valor não é uma hora válida.

source: This value is not a valid URL.
pt_br: Este valor não é uma URL válida.

source: The two values should be equal.
pt_br: Os dois valores devem ser iguais.

source: The file is too large. Allowed maximum size is {{ limit }} {{ suffix }}.
pt_br: O arquivo é muito grande. O tamanho máximo permitido é de {{ limit }} {{ suffix }}.

source: The file is too large.
pt_br: O arquivo é muito grande.

source: The file could not be uploaded.
pt_br: O arquivo não pode ser enviado.

source: This value should be a valid number.
pt_br: Este valor deve ser um número válido.

source: This file is not a valid image.
pt_br: Este arquivo não é uma imagem válida.

source: This is not a valid IP address.
pt_br: Este valor não é um endereço IP válido.

source: This value is not a valid language.
pt_br: Este valor não é um idioma válido.

source: This value is not a valid locale.
pt_br: Este valor não é uma localidade válida.

source: This value is not a valid country.
pt_br: Este valor não é um país válido.

source: This value is already used.
pt_br: Este valor já está sendo usado.

source: The size of the image could not be detected.
pt_br: O tamanho da imagem não pode ser detectado.

source: The image width is too big ({{ width }}px). Allowed maximum width is {{ max_width }}px.
pt_br: A largura da imagem é muito grande ({{ width }}px). A largura máxima permitida é de {{ max_width }}px.

source: The image width is too small ({{ width }}px). Minimum width expected is {{ min_width }}px.
pt_br: A largura da imagem é muito pequena ({{ width }}px). A largura mínima esperada é de {{ min_width }}px.

source: The image height is too big ({{ height }}px). Allowed maximum height is {{ max_height }}px.
pt_br: A altura da imagem é muito grande ({{ height }}px). A altura máxima permitida é de {{ max_height }}px.

source: The image height is too small ({{ height }}px). Minimum height expected is {{ min_height }}px.
pt_br: A altura da imagem é muito pequena ({{ height }}px). A altura mínima esperada é de {{ min_height }}px.

source: This value should be the user's current password.
pt_br: Este valor deve ser a senha atual do usuário.

source: This value should have exactly {{ limit }} character.|This value should have exactly {{ limit }} characters.
pt_br: Este valor deve ter exatamente {{ limit }} caractere.|Este valor deve ter exatamente {{ limit }} caracteres.

source: The file was only partially uploaded.
pt_br: O arquivo foi enviado apenas parcialmente.

source: No file was uploaded.
pt_br: Nenhum arquivo foi enviado.

source: No temporary folder was configured in php.ini.
pt_br: Nenhum diretório temporário foi configurado no php.ini, ou o diretório configurado não existe.

source: Cannot write temporary file to disk.
pt_br: Não foi possível escrever o arquivo temporário no disco.

source: A PHP extension caused the upload to fail.
pt_br: Uma extensão PHP fez com que o envio falhasse.

source: This collection should contain {{ limit }} element or more.|This collection should contain {{ limit }} elements or more.
pt_br: Esta coleção deve conter {{ limit }} elemento ou mais.|Esta coleção deve conter {{ limit }} elementos ou mais.

source: This collection should contain {{ limit }} element or less.|This collection should contain {{ limit }} elements or less.
pt_br: Esta coleção deve conter {{ limit }} elemento ou menos.|Esta coleção deve conter {{ limit }} elementos ou menos.

source: This collection should contain exactly {{ limit }} element.|This collection should contain exactly {{ limit }} elements.
pt_br: Esta coleção deve conter exatamente {{ limit }} elemento.|Esta coleção deve conter exatamente {{ limit }} elementos.

source: Invalid card number.
pt_br: Número de cartão inválido.

source: Unsupported card type or invalid card number.
pt_br: Tipo de cartão não suportado ou número de cartão inválido.

source: This is not a valid International Bank Account Number (IBAN).
pt_br: Este valor não é um Número de Conta Bancária Internacional (IBAN) válido.

source: This value is not a valid ISBN-10.
pt_br: Este valor não é um ISBN-10 válido.

source: This value is not a valid ISBN-13.
pt_br: Este valor não é um ISBN-13 válido.

source: This value is neither a valid ISBN-10 nor a valid ISBN-13.
pt_br: Este valor não é um ISBN-10 e nem um ISBN-13 válido.

source: This value is not a valid ISSN.
pt_br: Este valor não é um ISSN válido.

source: This value is not a valid currency.
pt_br: Este não é um valor monetário válido.

source: This value should be equal to {{ compared_value }}.
pt_br: Este valor deve ser igual a {{ compared_value }}.

source: This value should be greater than {{ compared_value }}.
pt_br: Este valor deve ser maior que {{ compared_value }}.

source: This value should be greater than or equal to {{ compared_value }}.
pt_br: Este valor deve ser maior ou igual a {{ compared_value }}.

source: This value should be identical to {{ compared_value_type }} {{ compared_value }}.
pt_br: Este valor deve ser idêntico a {{ compared_value_type }} {{ compared_value }}.

source: This value should be less than {{ compared_value }}.
pt_br: Este valor deve ser menor que {{ compared_value }}.

source: This value should be less than or equal to {{ compared_value }}.
pt_br: Este valor deve ser menor ou igual a {{ compared_value }}.

source: This value should not be equal to {{ compared_value }}.
pt_br: Este valor não deve ser igual a {{ compared_value }}.

source: This value should not be identical to {{ compared_value_type }} {{ compared_value }}.
pt_br: Este valor não deve ser idêntico a {{ compared_value_type }} {{ compared_value }}.

source: The image ratio is too big ({{ ratio }}). Allowed maximum ratio is {{ max_ratio }}.
pt_br: A proporção da imagem é muito grande ({{ ratio }}). A proporção máxima permitida é {{ max_ratio }}.

source: The image ratio is too small ({{ ratio }}). Minimum ratio expected is {{ min_ratio }}.
pt_br: A proporção da imagem é muito pequena ({{ ratio }}). A proporção mínima esperada é {{ min_ratio }}.

source: The image is square ({{ width }}x{{ height }}px). Square images are not allowed.
pt_br: A imagem está num formato quadrado ({{ width }}x{{ height }}px). Imagens com formato quadrado não são permitidas.

source: The image is landscape oriented ({{ width }}x{{ height }}px). Landscape oriented images are not allowed.
pt_br: A imagem está orientada à paisagem ({{ width }}x{{ height }}px). Imagens orientadas à paisagem não são permitidas.

source: The image is portrait oriented ({{ width }}x{{ height }}px). Portrait oriented images are not allowed.
pt_br: A imagem está orientada ao retrato ({{ width }}x{{ height }}px). Imagens orientadas ao retrato não são permitidas.

source: An empty file is not allowed.
pt_br: Arquivo vazio não é permitido.

source: The host could not be resolved.
pt_br: O host não pôde ser resolvido.

source: This value does not match the expected {{ charset }} charset.
pt_br: Este valor não corresponde ao charset {{ charset }} esperado.

source: This is not a valid Business Identifier Code (BIC).
pt_br: Este valor não é um Código de Identificação de Negócios (BIC) válido.

source: Error
pt_br: Erro

source: This is not a valid UUID.
pt_br: Este valor não é um UUID válido.

source: This value should be a multiple of {{ compared_value }}.
pt_br: Este valor deve ser múltiplo de {{ compared_value }}.

source: This Business Identifier Code (BIC) is not associated with IBAN {{ iban }}.
pt_br: Este Código Identificador Bancário (BIC) não está associado ao IBAN {{ iban }}.

source: This value should be valid JSON.
pt_br: Este valor deve ser um JSON válido.

source: This collection should contain only unique elements.
pt_br: Esta coleção deve conter somente elementos únicos.

source: This value should be positive.
pt_br: Este valor deve ser positivo.

source: This value should be either positive or zero.
pt_br: Este valor deve ser positivo ou zero.

source: This value should be negative.
pt_br: Este valor deve ser negativo.

source: This value should be either negative or zero.
pt_br: Este valor deve ser negativo ou zero.

source: This value is not a valid timezone.
pt_br: Este valor não representa um fuso horário válido.

source: This password has been leaked in a data breach, it must not be used. Please use another password.
pt_br: Esta senha foi divulgada num vazamento de dados e não deve ser utilizada. Por favor, utilize outra senha.

source: This value should be between {{ min }} and {{ max }}.
pt_br: Este valor deve estar entre {{ min }} e {{ max }}.

source: This value is not a valid hostname.
pt_br: Este valor não é um nome de host válido.

source: The number of elements in this collection should be a multiple of {{ compared_value }}.
pt_br: O número de elementos desta coleção deve ser um múltiplo de {{ compared_value }}.

source: This value should satisfy at least one of the following constraints:
pt_br: Este valor deve satisfazer pelo menos uma das seguintes restrições:

source: Each element of this collection should satisfy its own set of constraints.
pt_br: Cada elemento desta coleção deve satisfazer seu próprio grupo de restrições.

source: This value is not a valid International Securities Identification Number (ISIN).
pt_br: Este valor não é um Número de Identificação de Títulos Internacionais (ISIN) válido.

source: This value should be a valid expression.
pt_br: Este valor deve ser uma expressão válida.

source: This value is not a valid CSS color.
pt_br: Este valor não é uma cor CSS válida.

source: This value is not a valid CIDR notation.
pt_br: Este valor não é uma notação CIDR válida.

source: The value of the netmask should be between {{ min }} and {{ max }}.
pt_br: O valor da máscara de rede deve estar entre {{ min }} e {{ max }}.

source: The filename is too long. It should have {{ filename_max_length }} character or less.|The filename is too long. It should have {{ filename_max_length }} characters or less.
pt_br: O nome do arquivo é muito longo. Deve ter {{ filename_max_length }} caractere ou menos.|O nome do arquivo é muito longo. Deve ter {{ filename_max_length }} caracteres ou menos.

source: The password strength is too low. Please use a stronger password.
pt_br: A força da senha é muito baixa. Por favor, use uma senha mais forte.

source: This value contains characters that are not allowed by the current restriction-level.
pt_br: Este valor contém caracteres que não são permitidos pelo nível de restrição atual.

source: Using invisible characters is not allowed.
pt_br: O uso de caracteres invisíveis não é permitido.

source: Mixing numbers from different scripts is not allowed.
pt_br: Misturar números de scripts diferentes não é permitido.

source: Using hidden overlay characters is not allowed.
pt_br: O uso de caracteres de sobreposição ocultos não é permitido.

source: The extension of the file is invalid ({{ extension }}). Allowed extensions are {{ extensions }}.
pt_br: A extensão do arquivo é inválida ({{ extension }}). As extensões permitidas são {{ extensions }}.

source: The detected character encoding is invalid ({{ detected }}). Allowed encodings are {{ encodings }}.
pt_br: A codificação de caracteres detectada é inválida ({{ detected }}). As codificações permitidas são {{ encodings }}.

source: This value is not a valid MAC address.
pt_br: Este valor não é um endereço MAC válido.

source: This URL is missing a top-level domain.
pt_br: Esta URL está faltando o domínio de nível superior.

source: This value is too short. It should contain at least one word.|This value is too short. It should contain at least {{ min }} words.
pt_br: Este valor é muito curto. Deve conter pelo menos uma palavra.|Este valor é muito curto. Deve conter pelo menos {{ min }} palavras.

source: This value is too long. It should contain one word.|This value is too long. It should contain {{ max }} words or less.
pt_br: Este valor é muito longo. Deve conter apenas uma palavra.|Este valor é muito longo. Deve conter {{ max }} palavras ou menos.

source: This value does not represent a valid week in the ISO 8601 format.
pt_br: Este valor não representa uma semana válida no formato ISO 8601.

source: This value is not a valid week.
pt_br: Este valor não é uma semana válida.

# This value should not be before week &quot;{{ min }}&quot;.
source: This value should not be before week "{{ min }}".
pt_br: Este valor não deve ser anterior à semana "{{ min }}".

# This value should not be after week &quot;{{ max }}&quot;.
source: This value should not be after week "{{ max }}".
pt_br: Este valor não deve estar após a semana "{{ max }}".

source: This value is not a valid Twig template.
pt_br: Este valor não é um modelo Twig válido.

source: This file is not a valid video.
pt_br: Este arquivo não é um vídeo válido.

source: The size of the video could not be detected.
pt_br: Não foi possível detectar o tamanho do vídeo.

source: The video width is too big ({{ width }}px). Allowed maximum width is {{ max_width }}px.
pt_br: A largura do vídeo é muito grande ({{ width }}px). A largura máxima permitida é {{ max_width }}px.

source: The video width is too small ({{ width }}px). Minimum width expected is {{ min_width }}px.
pt_br: A largura do vídeo é muito pequena ({{ width }}px). A largura mínima esperada é {{ min_width }}px.

source: The video height is too big ({{ height }}px). Allowed maximum height is {{ max_height }}px.
pt_br: A altura do vídeo é muito grande ({{ height }}px). A altura máxima permitida é {{ max_height }}px.

source: The video height is too small ({{ height }}px). Minimum height expected is {{ min_height }}px.
pt_br: A altura do vídeo é muito pequena ({{ height }}px). A altura mínima esperada é {{ min_height }}px.

source: The video has too few pixels ({{ pixels }} pixels). Minimum amount expected is {{ min_pixels }} pixels.
pt_br: O vídeo tem poucos pixels ({{ pixels }}). A quantidade mínima esperada é {{ min_pixels }}.

source: The video has too many pixels ({{ pixels }} pixels). Maximum amount expected is {{ max_pixels }} pixels.
pt_br: O vídeo tem pixels demais ({{ pixels }}). A quantidade máxima esperada é {{ max_pixels }}.

source: The video ratio is too big ({{ ratio }}). Allowed maximum ratio is {{ max_ratio }}.
pt_br: A proporção do vídeo é muito grande ({{ ratio }}). A proporção máxima permitida é {{ max_ratio }}.

source: The video ratio is too small ({{ ratio }}). Minimum ratio expected is {{ min_ratio }}.
pt_br: A proporção do vídeo é muito pequena ({{ ratio }}). A proporção mínima esperada é {{ min_ratio }}.

source: The video is square ({{ width }}x{{ height }}px). Square videos are not allowed.
pt_br: O vídeo é quadrado ({{ width }}x{{ height }}px). Vídeos quadrados não são permitidos.

source: The video is landscape oriented ({{ width }}x{{ height }}px). Landscape oriented videos are not allowed.
pt_br: O vídeo está no modo paisagem ({{ width }}x{{ height }} px). Vídeos em paisagem não são permitidos.

source: The video is portrait oriented ({{ width }}x{{ height }}px). Portrait oriented videos are not allowed.
pt_br: O vídeo está em orientação vertical ({{ width }}x{{ height }}px). Vídeos em orientação vertical não são permitidos.

source: The video file is corrupted.
pt_br: O arquivo de vídeo está corrompido.

source: The video contains multiple streams. Only one stream is allowed.
pt_br: O vídeo contém múltiplos fluxos. Apenas um fluxo é permitido.

# Unsupported video codec &quot;{{ codec }}&quot;.
source: Unsupported video codec "{{ codec }}".
pt_br: Codec de vídeo não suportado «{{ codec }}».

# Unsupported video container &quot;{{ container }}&quot;.
source: Unsupported video container "{{ container }}".
pt_br: Contêiner de vídeo não suportado "{{ container }}".

source: The image file is corrupted.
pt_br: O arquivo de imagem está corrompido.

source: The image has too few pixels ({{ pixels }} pixels). Minimum amount expected is {{ min_pixels }} pixels.
pt_br: A imagem tem pixels de menos ({{ pixels }}). A quantidade mínima esperada é {{ min_pixels }}.

source: The image has too many pixels ({{ pixels }} pixels). Maximum amount expected is {{ max_pixels }} pixels.
pt_br: A imagem tem pixels demais ({{ pixels }}). A quantidade máxima esperada é {{ max_pixels }}.

source: This filename does not match the expected charset.
pt_br: Este nome de arquivo não corresponde ao conjunto de caracteres esperado.

source: This form should not contain extra fields.
pt_br: Este formulário não deve conter campos adicionais.

source: The uploaded file was too large. Please try to upload a smaller file.
pt_br: O arquivo enviado é muito grande. Por favor, tente enviar um arquivo menor.

source: The CSRF token is invalid. Please try to resubmit the form.
pt_br: O token CSRF é inválido. Por favor, tente reenviar o formulário.

source: This value is not a valid HTML5 color.
pt_br: Este valor não é uma cor HTML5 válida.

source: Please enter a valid birthdate.
pt_br: Por favor, informe uma data de nascimento válida.

source: The selected choice is invalid.
pt_br: A escolha selecionada é inválida.

source: The collection is invalid.
pt_br: A coleção é inválida.

source: Please select a valid color.
pt_br: Por favor, selecione uma cor válida.

source: Please select a valid country.
pt_br: Por favor, selecione um país válido.

source: Please select a valid currency.
pt_br: Por favor, selecione uma moeda válida.

source: Please choose a valid date interval.
pt_br: Por favor, escolha um intervalo de datas válido.

source: Please enter a valid date and time.
pt_br: Por favor, informe uma data e horário válidos.

source: Please enter a valid date.
pt_br: Por favor, informe uma data válida.

source: Please select a valid file.
pt_br: Por favor, selecione um arquivo válido.

source: The hidden field is invalid.
pt_br: O campo oculto é inválido.

source: Please enter an integer.
pt_br: Por favor, informe um número inteiro.

source: Please select a valid language.
pt_br: Por favor, selecione um idioma válido.

source: Please select a valid locale.
pt_br: Por favor, selecione uma configuração de local válida.

source: Please enter a valid money amount.
pt_br: Por favor, informe um valor monetário válido.

source: Please enter a number.
pt_br: Por favor, informe um número.

source: The password is invalid.
pt_br: A senha é inválida.

source: Please enter a percentage value.
pt_br: Por favor, informe um valor percentual.

source: The values do not match.
pt_br: Os valores não conferem.

source: Please enter a valid time.
pt_br: Por favor, informe um horário válido.

source: Please select a valid timezone.
pt_br: Por favor, selecione um fuso horário válido.

source: Please enter a valid URL.
pt_br: Por favor, informe uma URL válida.

source: Please enter a valid search term.
pt_br: Por favor, informe um termo de busca válido.

source: Please provide a valid phone number.
pt_br: Por favor, informe um telefone válido.

source: The checkbox has an invalid value.
pt_br: A caixa de seleção possui um valor inválido.

source: Please enter a valid email address.
pt_br: Por favor, informe um endereço de e-mail válido.

source: Please select a valid option.
pt_br: Por favor, selecione uma opção válida.

source: Please select a valid range.
pt_br: Por favor, selecione um intervalo válido.

source: Please enter a valid week.
pt_br: Por favor, informe uma semana válida.

source: You should agree to our terms.
pt_br: Você deve aceitar nossos termos.

source: Please enter a password
pt_br: Por favor, informe uma senha
